99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_display_command_buffer.c
#include "esp32_mquickjs_bitmap_internal.h"
#include "esp32_mquickjs_memory.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP

#include <limits.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include "esp_heap_caps.h"
#include "utils/esp32_mquickjs_byte_source.h"

#define DISPLAY_COMMAND_BUFFER_DEFAULT_COMMANDS 192U
#define DISPLAY_COMMAND_BUFFER_DEFAULT_TEXT_BYTES 2048U
#define DISPLAY_COMMAND_BUFFER_FONTS_KEY "__esp32qjsDisplayCommandFonts"
#define DISPLAY_COMMAND_TEXT_HAS_BACKGROUND 0x01U

#define DISPLAY_COMMAND_PACKED_CLEAR_SIZE 5U
#define DISPLAY_COMMAND_PACKED_RECT_SIZE 13U
#define DISPLAY_COMMAND_PACKED_ROUND_RECT_SIZE 15U
#define DISPLAY_COMMAND_PACKED_TEXT_SIZE 21U

typedef enum {
    DISPLAY_COMMAND_CLEAR = 1,
    DISPLAY_COMMAND_FILL_RECT = 2,
    DISPLAY_COMMAND_DRAW_RECT = 3,
    DISPLAY_COMMAND_DRAW_LINE = 4,
    DISPLAY_COMMAND_DRAW_ROUND_RECT = 5,
    DISPLAY_COMMAND_FILL_ROUND_RECT = 6,
    DISPLAY_COMMAND_DRAW_TEXT = 7,
} display_command_op_t;

typedef struct {
    uint8_t op;
    uint8_t flags;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    int32_t radius;
    int16_t spacing;
    uint32_t color;
    uint32_t background;
    size_t text_offset;
    size_t text_length;
    const esp32_mquickjs_bitmap_font_t *font;
} display_command_t;

typedef struct {
    display_command_t *commands;
    esp32_mquickjs_memory_block_t *commands_block;
    size_t count;
    size_t capacity;
    size_t default_capacity;
    char *text;
    esp32_mquickjs_memory_block_t *text_block;
    size_t text_length;
    size_t text_capacity;
    size_t default_text_capacity;
    uint8_t format;
    uint32_t foreground;
    uint32_t background;
    size_t font_ref_count;
    bool closed;
} display_command_buffer_t;

static void display_commands_relocated(void *opaque, void *data, size_t size)
{
    display_command_buffer_t *command_buffer = opaque;

    if (command_buffer == NULL) {
        return;
    }
    command_buffer->commands = data;
    command_buffer->capacity = size / sizeof(*command_buffer->commands);
}

static void display_text_relocated(void *opaque, void *data, size_t size)
{
    display_command_buffer_t *command_buffer = opaque;

    if (command_buffer == NULL) {
        return;
    }
    command_buffer->text = data;
    command_buffer->text_capacity = size;
}

static uint32_t abs_i32_to_u32_local(int32_t value)
{
    return value < 0 ? (uint32_t)(-(int64_t)value) : (uint32_t)value;
}

static uint16_t packed_u16(const uint8_t *data)
{
    return (uint16_t)data[0] | ((uint16_t)data[1] << 8U);
}

static int16_t packed_i16(const uint8_t *data)
{
    return (int16_t)packed_u16(data);
}

static uint32_t packed_u32(const uint8_t *data)
{
    return (uint32_t)data[0] |
           ((uint32_t)data[1] << 8U) |
           ((uint32_t)data[2] << 16U) |
           ((uint32_t)data[3] << 24U);
}

static display_command_buffer_t *display_command_buffer_from_value(JSContext *ctx,
                                                                   JSValue value,
                                                                   const char *api_name)
{
    display_command_buffer_t *command_buffer;

    if (JS_GetClassID(ctx, value) != JS_CLASS_DISPLAY_COMMAND_BUFFER) {
        JS_ThrowTypeError(ctx, "%s expects a DisplayCommandBuffer", api_name);
        return NULL;
    }
    command_buffer = JS_GetOpaque(ctx, value);
    if (command_buffer == NULL || command_buffer->closed) {
        JS_ThrowReferenceError(ctx, "%s failed because the DisplayCommandBuffer is closed", api_name);
        return NULL;
    }
    return command_buffer;
}

static void display_command_buffer_reset_internal(JSContext *ctx, display_command_buffer_t *command_buffer)
{
    (void)ctx;
    if (command_buffer == NULL) {
        return;
    }
    command_buffer->count = 0;
    command_buffer->text_length = 0;
    command_buffer->font_ref_count = 0;
}

static void display_command_buffer_close_internal(JSContext *ctx, display_command_buffer_t *command_buffer)
{
    if (command_buffer == NULL || command_buffer->closed) {
        return;
    }
    display_command_buffer_reset_internal(ctx, command_buffer);
    (void)esp32_mquickjs_memory_block_free(command_buffer->commands_block);
    (void)esp32_mquickjs_memory_block_free(command_buffer->text_block);
    command_buffer->commands_block = NULL;
    command_buffer->text_block = NULL;
    command_buffer->commands = NULL;
    command_buffer->text = NULL;
    command_buffer->capacity = 0;
    command_buffer->text_capacity = 0;
    command_buffer->closed = true;
}

static bool reserve_commands(JSContext *ctx, display_command_buffer_t *command_buffer, size_t extra)
{
    display_command_t *next;
    size_t needed;
    size_t next_capacity;

    if (extra > SIZE_MAX - command_buffer->count) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    needed = command_buffer->count + extra;
    if (needed <= command_buffer->capacity) {
        return true;
    }
    next_capacity = command_buffer->capacity > 0 ? command_buffer->capacity : command_buffer->default_capacity;
    if (next_capacity == 0) {
        next_capacity = DISPLAY_COMMAND_BUFFER_DEFAULT_COMMANDS;
    }
    while (next_capacity < needed) {
        if (next_capacity > SIZE_MAX / 2U) {
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
        next_capacity *= 2U;
    }
    if (next_capacity > SIZE_MAX / sizeof(*next)) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    if (command_buffer->commands_block == NULL) {
        command_buffer->commands_block = esp32_mquickjs_memory_block_alloc(
            next_capacity * sizeof(*next),
            ESP32_MQUICKJS_MEMORY_HOT_MOVABLE,
            display_commands_relocated,
            command_buffer);
        if (command_buffer->commands_block == NULL) {
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
    } else if (!esp32_mquickjs_memory_block_resize(
                   command_buffer->commands_block,
                   next_capacity * sizeof(*next))) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    return true;
}

