99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_display_command_buffer.c
static bool reserve_text(JSContext *ctx, display_command_buffer_t *command_buffer, size_t extra)
{
    char *next;
    size_t needed;
    size_t next_capacity;

    if (extra > SIZE_MAX - command_buffer->text_length) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    needed = command_buffer->text_length + extra;
    if (needed <= command_buffer->text_capacity) {
        return true;
    }
    next_capacity = command_buffer->text_capacity > 0
        ? command_buffer->text_capacity
        : command_buffer->default_text_capacity;
    if (next_capacity == 0) {
        next_capacity = DISPLAY_COMMAND_BUFFER_DEFAULT_TEXT_BYTES;
    }
    while (next_capacity < needed) {
        if (next_capacity > SIZE_MAX / 2U) {
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
        next_capacity *= 2U;
    }
    if (command_buffer->text_block == NULL) {
        command_buffer->text_block = esp32_mquickjs_memory_block_alloc(
            next_capacity,
            ESP32_MQUICKJS_MEMORY_HOT_MOVABLE,
            display_text_relocated,
            command_buffer);
        if (command_buffer->text_block == NULL) {
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
    } else if (!esp32_mquickjs_memory_block_resize(
                   command_buffer->text_block, next_capacity)) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    return true;
}

static display_command_t *append_command(JSContext *ctx, display_command_buffer_t *command_buffer)
{
    display_command_t *command;

    if (!reserve_commands(ctx, command_buffer, 1U)) {
        return NULL;
    }
    command = &command_buffer->commands[command_buffer->count++];
    memset(command, 0, sizeof(*command));
    return command;
}

static bool get_u32_option(JSContext *ctx,
                           JSValue options,
                           const char *name,
                           uint32_t *out_value,
                           const char *api_name)
{
    JSGCRef property_ref;
    JSValue *property;
    bool ok = true;

    if (JS_IsUndefined(options) || JS_IsNull(options)) {
        return true;
    }
    property = JS_PushGCRef(ctx, &property_ref);
    *property = JS_GetPropertyStr(ctx, options, name);
    if (JS_IsException(*property)) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    if (!JS_IsUndefined(*property) && !JS_IsNull(*property) &&
        !value_to_u32(ctx, *property, out_value)) {
        JS_ThrowTypeError(ctx, "%s option '%s' expects a non-negative integer", api_name, name);
        ok = false;
    }
    JS_PopGCRef(ctx, &property_ref);
    return ok;
}

static int text_spacing_from_options(JSContext *ctx, JSValue options, int default_spacing)
{
    JSGCRef property_ref;
    JSValue *property;
    int32_t spacing = default_spacing;

    if (JS_IsUndefined(options) || JS_IsNull(options)) {
        return default_spacing;
    }
    property = JS_PushGCRef(ctx, &property_ref);
    *property = JS_GetPropertyStr(ctx, options, "spacing");
    if (!JS_IsException(*property) && !JS_IsUndefined(*property) && !JS_IsNull(*property)) {
        if (!value_to_i32(ctx, *property, &spacing)) {
            spacing = default_spacing;
        }
    }
    JS_PopGCRef(ctx, &property_ref);
    if (spacing < 0) {
        spacing = 0;
    }
    if (spacing > 32) {
        spacing = 32;
    }
    return (int)spacing;
}

static bool text_options_is_object(JSContext *ctx, JSValue options, const char *api_name)
{
    int class_id;

    if (JS_IsUndefined(options) || JS_IsNull(options)) {
        return true;
    }
    class_id = JS_GetClassID(ctx, options);
    if (class_id < 0 || class_id == JS_CLASS_DISPLAY_FONT) {
        JS_ThrowTypeError(ctx, "%s options must be an object", api_name);
        return false;
    }
    return true;
}

static bool text_font_from_options(JSContext *ctx,
                                   JSValue options,
                                   const char *api_name,
                                   const esp32_mquickjs_bitmap_font_t **out_font,
                                   JSValue *out_font_value)
{
    JSGCRef property_ref;
    JSValue *property;
    esp32_mquickjs_display_font_t *font;

    *out_font = NULL;
    *out_font_value = JS_UNDEFINED;
    if (JS_IsUndefined(options) || JS_IsNull(options)) {
        JS_ThrowTypeError(ctx, "%s requires a DisplayFont", api_name);
        return false;
    }

    property = JS_PushGCRef(ctx, &property_ref);
    *property = JS_GetPropertyStr(ctx, options, "font");
    if (JS_IsException(*property)) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    if (JS_IsUndefined(*property) || JS_IsNull(*property)) {
        JS_PopGCRef(ctx, &property_ref);
        JS_ThrowTypeError(ctx, "%s requires a DisplayFont", api_name);
        return false;
    }
    font = display_font_from_value(ctx, *property, api_name);
    if (font != NULL) {
        *out_font = &font->font;
        *out_font_value = *property;
    }
    JS_PopGCRef(ctx, &property_ref);
    return font != NULL;
}

static bool keep_font_alive(JSContext *ctx,
                            JSValue owner,
                            display_command_buffer_t *command_buffer,
                            JSValue font_value)
{
    JSGCRef owner_ref;
    JSGCRef font_ref;
    JSGCRef fonts_ref;
    JSValue *rooted_owner;
    JSValue *rooted_font;
    JSValue *fonts;
    bool ok = true;

    rooted_owner = JS_PushGCRef(ctx, &owner_ref);
    rooted_font = JS_PushGCRef(ctx, &font_ref);
    fonts = JS_PushGCRef(ctx, &fonts_ref);
    *rooted_owner = owner;
    *rooted_font = font_value;
    *fonts = JS_GetPropertyStr(ctx, *rooted_owner, DISPLAY_COMMAND_BUFFER_FONTS_KEY);
    if (JS_IsException(*fonts)) {
        JS_PopGCRef(ctx, &fonts_ref);
        JS_PopGCRef(ctx, &font_ref);
        JS_PopGCRef(ctx, &owner_ref);
        return false;
    }
    if (JS_IsUndefined(*fonts) || JS_IsNull(*fonts) || JS_GetClassID(ctx, *fonts) != JS_CLASS_ARRAY) {
        *fonts = JS_NewArray(ctx, 0);
        if (JS_IsException(*fonts) ||
            !esp32_mquickjs_set_property_ref(ctx, rooted_owner, DISPLAY_COMMAND_BUFFER_FONTS_KEY, *fonts)) {
            JS_PopGCRef(ctx, &fonts_ref);
            JS_PopGCRef(ctx, &font_ref);
            JS_PopGCRef(ctx, &owner_ref);
            return false;
        }
    }
    if (command_buffer->font_ref_count > UINT32_MAX ||
        JS_IsException(JS_SetPropertyUint32(ctx,
                                            *fonts,
                                            (uint32_t)command_buffer->font_ref_count,
                                            *rooted_font))) {
        ok = false;
    } else {
        command_buffer->font_ref_count += 1U;
    }
    JS_PopGCRef(ctx, &fonts_ref);
    JS_PopGCRef(ctx, &font_ref);
    JS_PopGCRef(ctx, &owner_ref);
    return ok;
}

static bool text_background_from_options(JSContext *ctx,
                                         uint8_t format,
                                         JSValue options,
                                         uint32_t fallback,
                                         uint32_t *out_color,
                                         bool *out_has_background)
{
    JSGCRef property_ref;
    JSValue *property;
    bool ok;

    *out_color = fallback;
    *out_has_background = false;
    if (JS_IsUndefined(options) || JS_IsNull(options)) {
        return true;
    }

    property = JS_PushGCRef(ctx, &property_ref);
    *property = JS_GetPropertyStr(ctx, options, "background");
    if (JS_IsException(*property)) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    if (JS_IsUndefined(*property) || JS_IsNull(*property)) {
        JS_PopGCRef(ctx, &property_ref);
        return true;
    }
    *out_color = normalize_color(ctx, format, *property, fallback, &ok);
    JS_PopGCRef(ctx, &property_ref);
    if (!ok) {
        return false;
    }
    *out_has_background = true;
    return true;
}

static bool packed_color_is_valid(uint8_t format, uint32_t color)
{
    if (format == BITMAP_FORMAT_MONO1) {
        return color <= 1U;
    }
    if (format == BITMAP_FORMAT_GRAY8) {
        return color <= 0xffU;
    }
    if (format == BITMAP_FORMAT_RGB565) {
        return color <= 0xffffU;
    }
    return format == BITMAP_FORMAT_RGB888 && color <= 0xffffffU;
}

static bool packed_skip_command(const uint8_t *data, uint8_t op)
{
    switch (op) {
    case DISPLAY_COMMAND_FILL_RECT:
    case DISPLAY_COMMAND_DRAW_RECT:
        return packed_i16(data + 5) <= 0 || packed_i16(data + 7) <= 0;
    case DISPLAY_COMMAND_DRAW_ROUND_RECT:
    case DISPLAY_COMMAND_FILL_ROUND_RECT:
        return packed_i16(data + 5) <= 0 || packed_i16(data + 7) <= 0;
    case DISPLAY_COMMAND_DRAW_TEXT:
        return packed_u16(data + 19) == 0U;
    default:
        return false;
    }
}

static bool packed_command_scan(JSContext *ctx,
                                const uint8_t *data,
                                size_t length,
                                size_t text_length,
                                uint8_t format,
                                size_t *out_count,
                                size_t *out_text_bytes,
                                bool *out_needs_font)
{
    size_t offset = 0;
    size_t count = 0;
    size_t text_bytes = 0;
    bool needs_font = false;

    while (offset < length) {
        uint8_t op = data[offset];
        size_t command_size;
        uint32_t color = 0;
        uint32_t background = 0;

        switch (op) {
        case DISPLAY_COMMAND_CLEAR:
            command_size = DISPLAY_COMMAND_PACKED_CLEAR_SIZE;
            break;
        case DISPLAY_COMMAND_FILL_RECT:
        case DISPLAY_COMMAND_DRAW_RECT:
        case DISPLAY_COMMAND_DRAW_LINE:
            command_size = DISPLAY_COMMAND_PACKED_RECT_SIZE;
            break;
        case DISPLAY_COMMAND_DRAW_ROUND_RECT:
        case DISPLAY_COMMAND_FILL_ROUND_RECT:
            command_size = DISPLAY_COMMAND_PACKED_ROUND_RECT_SIZE;
            break;
        case DISPLAY_COMMAND_DRAW_TEXT: {
            uint16_t flags;
            uint16_t text_offset;
            uint16_t command_text_length;

            command_size = DISPLAY_COMMAND_PACKED_TEXT_SIZE;
            if (length - offset < command_size) {
                JS_ThrowTypeError(ctx, "DisplayCommandBuffer.appendPacked() found a truncated text command");
                return false;
            }
            color = packed_u32(data + offset + 5U);
            background = packed_u32(data + offset + 9U);
            flags = packed_u16(data + offset + 13U);
            text_offset = packed_u16(data + offset + 17U);
            command_text_length = packed_u16(data + offset + 19U);
            if ((flags & ~DISPLAY_COMMAND_TEXT_HAS_BACKGROUND) != 0U) {
                JS_ThrowTypeError(ctx, "DisplayCommandBuffer.appendPacked() found unsupported text flags");
                return false;
            }
            if (command_text_length > 0U) {
                if ((size_t)text_offset > text_length ||
                    (size_t)command_text_length > text_length - (size_t)text_offset) {
                    JS_ThrowTypeError(ctx, "DisplayCommandBuffer.appendPacked() found a text range outside options.text");
                    return false;
                }
                needs_font = true;
                if ((size_t)command_text_length > SIZE_MAX - text_bytes - 1U) {
                    JS_ThrowOutOfMemory(ctx);
                    return false;
                }
                text_bytes += (size_t)command_text_length + 1U;
            }
            break;
        }
        default:
            JS_ThrowTypeError(ctx, "DisplayCommandBuffer.appendPacked() found an unsupported command opcode");
            return false;
        }

        if (length - offset < command_size) {
            JS_ThrowTypeError(ctx, "DisplayCommandBuffer.appendPacked() found a truncated command");
            return false;
        }
        switch (op) {
        case DISPLAY_COMMAND_CLEAR:
            color = packed_u32(data + offset + 1U);
            break;
        case DISPLAY_COMMAND_FILL_RECT:
        case DISPLAY_COMMAND_DRAW_RECT:
        case DISPLAY_COMMAND_DRAW_LINE:
            color = packed_u32(data + offset + 9U);
            break;
        case DISPLAY_COMMAND_DRAW_ROUND_RECT:
        case DISPLAY_COMMAND_FILL_ROUND_RECT:
            color = packed_u32(data + offset + 11U);
            break;
        default:
            break;
        }
        if (!packed_color_is_valid(format, color) ||
            (op == DISPLAY_COMMAND_DRAW_TEXT &&
             !packed_color_is_valid(format, background))) {
            JS_ThrowTypeError(ctx, "DisplayCommandBuffer.appendPacked() found an invalid packed color");
            return false;
        }
        if (!packed_skip_command(data + offset, op)) {
            count += 1U;
        }
        offset += command_size;
    }

    *out_count = count;
    *out_text_bytes = text_bytes;
    *out_needs_font = needs_font;
    return true;
}

JSValue js_display_command_buffer_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;

