99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_display_command_buffer.c
    return JS_ThrowTypeError(ctx, "DisplayCommandBuffer objects are created by Bitmap.createCommandBuffer()");
}

void js_display_command_buffer_finalizer(JSContext *ctx, void *opaque)
{
    display_command_buffer_t *command_buffer = opaque;

    display_command_buffer_close_internal(ctx, command_buffer);
    heap_caps_free(command_buffer);
}

JSValue js_bitmap_create_command_buffer(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_bitmap_t *buffer;
    display_command_buffer_t *command_buffer;
    uint32_t command_capacity = DISPLAY_COMMAND_BUFFER_DEFAULT_COMMANDS;
    uint32_t text_capacity = DISPLAY_COMMAND_BUFFER_DEFAULT_TEXT_BYTES;
    JSGCRef object_ref;
    JSValue *object;

    buffer = bitmap_from_value(ctx, *this_val, "Bitmap.createCommandBuffer()");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (!text_options_is_object(ctx, argc >= 1 ? argv[0] : JS_UNDEFINED, "Bitmap.createCommandBuffer()") ||
        !get_u32_option(ctx, argc >= 1 ? argv[0] : JS_UNDEFINED,
                        "commandCapacity", &command_capacity, "Bitmap.createCommandBuffer()") ||
        !get_u32_option(ctx, argc >= 1 ? argv[0] : JS_UNDEFINED,
                        "textBytes", &text_capacity, "Bitmap.createCommandBuffer()")) {
        return JS_EXCEPTION;
    }
    if (command_capacity == 0) {
        command_capacity = DISPLAY_COMMAND_BUFFER_DEFAULT_COMMANDS;
    }
    if (text_capacity == 0) {
        text_capacity = DISPLAY_COMMAND_BUFFER_DEFAULT_TEXT_BYTES;
    }

    command_buffer = heap_caps_malloc(sizeof(*command_buffer), MALLOC_CAP_8BIT);
    if (command_buffer == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    memset(command_buffer, 0, sizeof(*command_buffer));
    command_buffer->default_capacity = command_capacity;
    command_buffer->default_text_capacity = text_capacity;
    command_buffer->format = buffer->format;
    command_buffer->foreground = buffer->foreground;
    command_buffer->background = buffer->background;

    object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_DISPLAY_COMMAND_BUFFER);
    if (JS_IsException(*object)) {
        JS_PopGCRef(ctx, &object_ref);
        heap_caps_free(command_buffer);
        return JS_EXCEPTION;
    }
    JS_SetOpaque(ctx, *object, command_buffer);
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_display_command_buffer_reset(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    display_command_buffer_t *command_buffer;

    (void)argc;
    (void)argv;

    command_buffer = display_command_buffer_from_value(ctx, *this_val, "DisplayCommandBuffer.reset()");
    if (command_buffer == NULL) {
        return JS_EXCEPTION;
    }
    display_command_buffer_reset_internal(ctx, command_buffer);
    if (!esp32_mquickjs_set_property_ref(ctx, this_val, DISPLAY_COMMAND_BUFFER_FONTS_KEY, JS_UNDEFINED)) {
        return JS_EXCEPTION;
    }
    return *this_val;
}

JSValue js_display_command_buffer_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    display_command_buffer_t *command_buffer;

    (void)argc;
    (void)argv;

    if (JS_GetClassID(ctx, *this_val) != JS_CLASS_DISPLAY_COMMAND_BUFFER) {
        return JS_ThrowTypeError(ctx, "DisplayCommandBuffer.close() expects a DisplayCommandBuffer");
    }
    command_buffer = JS_GetOpaque(ctx, *this_val);
    display_command_buffer_close_internal(ctx, command_buffer);
    if (!esp32_mquickjs_set_property_ref(ctx, this_val, DISPLAY_COMMAND_BUFFER_FONTS_KEY, JS_UNDEFINED)) {
        return JS_EXCEPTION;
    }
    return JS_TRUE;
}

JSValue js_display_command_buffer_clear(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    display_command_buffer_t *command_buffer;
    display_command_t *command;
    uint32_t color;
    bool ok;

    command_buffer = display_command_buffer_from_value(ctx, *this_val, "DisplayCommandBuffer.clear()");
    if (command_buffer == NULL) {
        return JS_EXCEPTION;
    }
    color = normalize_color(ctx, command_buffer->format, argc >= 1 ? argv[0] : JS_UNDEFINED, command_buffer->background, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayCommandBuffer.clear(color?) expects a valid color");
    }
    command = append_command(ctx, command_buffer);
    if (command == NULL) {
        return JS_EXCEPTION;
    }
    command->op = DISPLAY_COMMAND_CLEAR;
    command->color = color;
    return *this_val;
}

JSValue js_display_command_buffer_fill_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    display_command_buffer_t *command_buffer;
    display_command_t *command;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    uint32_t color;
    bool ok;

    command_buffer = display_command_buffer_from_value(ctx, *this_val, "DisplayCommandBuffer.fillRect()");
    if (command_buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (!rect_from_args(ctx, argc, argv, &x, &y, &width, &height, "DisplayCommandBuffer.fillRect()")) {
        return JS_EXCEPTION;
    }
    if (width <= 0 || height <= 0) {
        return *this_val;
    }
    color = normalize_color(ctx, command_buffer->format, argc >= 5 ? argv[4] : JS_UNDEFINED, command_buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayCommandBuffer.fillRect(x, y, width, height, color) expects a valid color");
    }
    command = append_command(ctx, command_buffer);
    if (command == NULL) {
        return JS_EXCEPTION;
    }
    command->op = DISPLAY_COMMAND_FILL_RECT;
    command->x = x;
    command->y = y;
    command->width = width;
    command->height = height;
    command->color = color;
    return *this_val;
}

JSValue js_display_command_buffer_draw_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    display_command_buffer_t *command_buffer;
    display_command_t *command;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    uint32_t color;
    bool ok;

    command_buffer = display_command_buffer_from_value(ctx, *this_val, "DisplayCommandBuffer.drawRect()");
    if (command_buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (!rect_from_args(ctx, argc, argv, &x, &y, &width, &height, "DisplayCommandBuffer.drawRect()")) {
        return JS_EXCEPTION;
    }
    if (width <= 0 || height <= 0) {
        return *this_val;
    }
    color = normalize_color(ctx, command_buffer->format, argc >= 5 ? argv[4] : JS_UNDEFINED, command_buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayCommandBuffer.drawRect(x, y, width, height, color) expects a valid color");
    }
    command = append_command(ctx, command_buffer);
    if (command == NULL) {
        return JS_EXCEPTION;
    }
    command->op = DISPLAY_COMMAND_DRAW_RECT;
    command->x = x;
    command->y = y;
    command->width = width;
    command->height = height;
    command->color = color;
    return *this_val;
}

JSValue js_display_command_buffer_draw_line(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    display_command_buffer_t *command_buffer;
    display_command_t *command;
    int32_t x0;
    int32_t y0;
    int32_t x1;
    int32_t y1;
    uint32_t color;
    bool ok;

    command_buffer = display_command_buffer_from_value(ctx, *this_val, "DisplayCommandBuffer.drawLine()");
    if (command_buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 4 || !value_to_i32(ctx, argv[0], &x0) || !value_to_i32(ctx, argv[1], &y0) ||
        !value_to_i32(ctx, argv[2], &x1) || !value_to_i32(ctx, argv[3], &y1)) {
        return JS_ThrowTypeError(ctx, "DisplayCommandBuffer.drawLine(x0, y0, x1, y1, color) expects integer coordinates");
    }
    color = normalize_color(ctx, command_buffer->format, argc >= 5 ? argv[4] : JS_UNDEFINED, command_buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayCommandBuffer.drawLine(x0, y0, x1, y1, color) expects a valid color");
    }
    command = append_command(ctx, command_buffer);
    if (command == NULL) {
        return JS_EXCEPTION;
    }
    command->op = DISPLAY_COMMAND_DRAW_LINE;
    command->x = x0;
    command->y = y0;
    command->width = x1;
    command->height = y1;
    command->color = color;
    return *this_val;
}

JSValue js_display_command_buffer_draw_round_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    display_command_buffer_t *command_buffer;
    display_command_t *command;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    int32_t radius;
    uint32_t color;
    bool ok;

    command_buffer = display_command_buffer_from_value(ctx, *this_val, "DisplayCommandBuffer.drawRoundRect()");
    if (command_buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 5 || !value_to_i32(ctx, argv[0], &x) || !value_to_i32(ctx, argv[1], &y) ||
        !value_to_i32(ctx, argv[2], &width) || !value_to_i32(ctx, argv[3], &height) ||
        !value_to_i32(ctx, argv[4], &radius)) {
        return JS_ThrowTypeError(ctx,
                                 "DisplayCommandBuffer.drawRoundRect(x, y, width, height, radius, color) expects integer coordinates");
    }
    color = normalize_color(ctx, command_buffer->format, argc >= 6 ? argv[5] : JS_UNDEFINED, command_buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayCommandBuffer.drawRoundRect(x, y, width, height, radius, color) expects a valid color");
    }
    if (width <= 0 || height <= 0) {
        return *this_val;
    }
    command = append_command(ctx, command_buffer);
    if (command == NULL) {
        return JS_EXCEPTION;
    }
    command->op = DISPLAY_COMMAND_DRAW_ROUND_RECT;
    command->x = x;
    command->y = y;
    command->width = width;
    command->height = height;
    command->radius = radius;
    command->color = color;
    return *this_val;
}

JSValue js_display_command_buffer_fill_round_rect(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    display_command_buffer_t *command_buffer;
    display_command_t *command;
    int32_t x;
    int32_t y;
    int32_t width;
    int32_t height;
    int32_t radius;
    uint32_t color;
    bool ok;

    command_buffer = display_command_buffer_from_value(ctx, *this_val, "DisplayCommandBuffer.fillRoundRect()");
    if (command_buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 5 || !value_to_i32(ctx, argv[0], &x) || !value_to_i32(ctx, argv[1], &y) ||
        !value_to_i32(ctx, argv[2], &width) || !value_to_i32(ctx, argv[3], &height) ||
        !value_to_i32(ctx, argv[4], &radius)) {
        return JS_ThrowTypeError(ctx,
                                 "DisplayCommandBuffer.fillRoundRect(x, y, width, height, radius, color) expects integer coordinates");
    }
    color = normalize_color(ctx, command_buffer->format, argc >= 6 ? argv[5] : JS_UNDEFINED, command_buffer->foreground, &ok);
    if (!ok) {
        return JS_ThrowTypeError(ctx, "DisplayCommandBuffer.fillRoundRect(x, y, width, height, radius, color) expects a valid color");
    }
    if (width <= 0 || height <= 0) {
        return *this_val;
    }
    command = append_command(ctx, command_buffer);
    if (command == NULL) {
        return JS_EXCEPTION;
    }
    command->op = DISPLAY_COMMAND_FILL_ROUND_RECT;
    command->x = x;
    command->y = y;
    command->width = width;
    command->height = height;
    command->radius = radius;
    command->color = color;
    return *this_val;
}

JSValue js_display_command_buffer_draw_text(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    display_command_buffer_t *command_buffer;
    display_command_t *command;
    int32_t x;
    int32_t y;
    uint32_t color;
    uint32_t background;
    bool ok;
    bool has_background;
    JSCStringBuf text_buf;
    const char *text;
    size_t text_length;
    int spacing;
    const esp32_mquickjs_bitmap_font_t *font;
    JSGCRef font_value_ref;
    JSValue *font_value;
    JSGCRef property_ref;
    JSValue *property;

    command_buffer = display_command_buffer_from_value(ctx, *this_val, "DisplayCommandBuffer.drawText()");
    if (command_buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 3 || !value_to_i32(ctx, argv[0], &x) || !value_to_i32(ctx, argv[1], &y)) {
        return JS_ThrowTypeError(ctx, "DisplayCommandBuffer.drawText(x, y, text, options?) expects x, y, and text");
    }

    font_value = JS_PushGCRef(ctx, &font_value_ref);
    *font_value = JS_UNDEFINED;
    if (!text_options_is_object(ctx, argc >= 4 ? argv[3] : JS_UNDEFINED,
                                "DisplayCommandBuffer.drawText()")) {
        goto fail;
    }
    color = command_buffer->foreground;
    if (argc >= 4 && !JS_IsUndefined(argv[3]) && !JS_IsNull(argv[3])) {
        property = JS_PushGCRef(ctx, &property_ref);
        *property = JS_GetPropertyStr(ctx, argv[3], "color");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            goto fail;
        }
        color = normalize_color(ctx, command_buffer->format, *property, command_buffer->foreground, &ok);
        JS_PopGCRef(ctx, &property_ref);
        if (!ok) {
            JS_ThrowTypeError(ctx, "DisplayCommandBuffer.drawText() option 'color' expects a valid color");
            goto fail;
        }
    }
    spacing = text_spacing_from_options(ctx, argc >= 4 ? argv[3] : JS_UNDEFINED, 0);
    if (!text_font_from_options(ctx,
                                argc >= 4 ? argv[3] : JS_UNDEFINED,
                                "DisplayCommandBuffer.drawText() option 'font'",
                                &font,
                                font_value)) {
        goto fail;
    }
    if (!text_background_from_options(ctx,
                                      command_buffer->format,
                                      argc >= 4 ? argv[3] : JS_UNDEFINED,
                                      command_buffer->background,
                                      &background,
                                      &has_background)) {
        JS_ThrowTypeError(ctx, "DisplayCommandBuffer.drawText() option 'background' expects a valid color or null");
        goto fail;
    }
    if (!keep_font_alive(ctx, *this_val, command_buffer, *font_value)) {
        goto fail;
    }

    text = JS_ToCStringLen(ctx, &text_length, argv[2], &text_buf);
    if (text == NULL || text_length == SIZE_MAX ||
        !reserve_text(ctx, command_buffer, text_length + 1U) ||
        !reserve_commands(ctx, command_buffer, 1U)) {
        goto fail;
    }

    command = &command_buffer->commands[command_buffer->count];
    memset(command, 0, sizeof(*command));
    command->op = DISPLAY_COMMAND_DRAW_TEXT;
    command->flags = has_background ? DISPLAY_COMMAND_TEXT_HAS_BACKGROUND : 0U;
    command->x = x;
    command->y = y;
    command->spacing = (int16_t)spacing;
    command->color = color;
    command->background = background;
    command->text_offset = command_buffer->text_length;
    command->text_length = text_length;
    command->font = font;
    memcpy(command_buffer->text + command_buffer->text_length, text, text_length);
    command_buffer->text[command_buffer->text_length + text_length] = '\0';
    command_buffer->text_length += text_length + 1U;
    command_buffer->count += 1U;
    JS_PopGCRef(ctx, &font_value_ref);
    return *this_val;

