99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_display_command_buffer.c
fail:
    JS_PopGCRef(ctx, &font_value_ref);
    return JS_EXCEPTION;
}

JSValue js_display_command_buffer_append_packed(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    display_command_buffer_t *command_buffer;
    esp32_mquickjs_byte_source_t source;
    uint8_t *owned = NULL;
    char *owned_text = NULL;
    JSValue error = JS_UNDEFINED;
    JSGCRef text_value_ref;
    JSGCRef font_value_ref;
    JSValue *text_value;
    JSValue *font_value;
    JSCStringBuf text_buf;
    const char *packed_text = "";
    size_t packed_text_length = 0;
    const esp32_mquickjs_bitmap_font_t *font = NULL;
    esp32_mquickjs_display_font_t *font_object = NULL;
    size_t command_count = 0;
    size_t text_bytes = 0;
    bool needs_font = false;
    size_t offset = 0;

    command_buffer = display_command_buffer_from_value(ctx, *this_val, "DisplayCommandBuffer.appendPacked()");
    if (command_buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 1 ||
        !esp32_mquickjs_get_byte_source(ctx,
                                        argv[0],
                                        "DisplayCommandBuffer.appendPacked(bytes)",
                                        &source,
                                        &owned,
                                        &error)) {
        return JS_IsUndefined(error)
                   ? JS_ThrowTypeError(ctx, "DisplayCommandBuffer.appendPacked(bytes, options?) expects byte commands")
                   : error;
    }

    text_value = JS_PushGCRef(ctx, &text_value_ref);
    *text_value = JS_UNDEFINED;
    font_value = JS_PushGCRef(ctx, &font_value_ref);
    *font_value = JS_UNDEFINED;

    if (!text_options_is_object(ctx, argc >= 2 ? argv[1] : JS_UNDEFINED,
                                "DisplayCommandBuffer.appendPacked()")) {
        goto fail;
    }
    if (argc >= 2 && !JS_IsUndefined(argv[1]) && !JS_IsNull(argv[1])) {
        *text_value = JS_GetPropertyStr(ctx, argv[1], "text");
        if (JS_IsException(*text_value)) {
            goto fail;
        }
        if (!JS_IsUndefined(*text_value) && !JS_IsNull(*text_value)) {
            packed_text = JS_ToCStringLen(ctx, &packed_text_length, *text_value, &text_buf);
            if (packed_text == NULL || packed_text_length == SIZE_MAX) {
                goto fail;
            }
            owned_text = heap_caps_malloc(packed_text_length + 1U, MALLOC_CAP_8BIT);
            if (owned_text == NULL) {
                JS_ThrowOutOfMemory(ctx);
                goto fail;
            }
            memcpy(owned_text, packed_text, packed_text_length);
            owned_text[packed_text_length] = '\0';
            packed_text = owned_text;
        }
        *font_value = JS_GetPropertyStr(ctx, argv[1], "font");
        if (JS_IsException(*font_value)) {
            goto fail;
        }
        if (!JS_IsUndefined(*font_value) && !JS_IsNull(*font_value)) {
            font_object = display_font_from_value(ctx,
                                                  *font_value,
                                                  "DisplayCommandBuffer.appendPacked() option 'font'");
            if (font_object == NULL) {
                goto fail;
            }
            font = &font_object->font;
        }
    }

    if (!packed_command_scan(ctx,
                             source.data,
                             source.length,
                             packed_text_length,
                             command_buffer->format,
                             &command_count,
                             &text_bytes,
                             &needs_font)) {
        goto fail;
    }
    if (needs_font && font == NULL) {
        JS_ThrowTypeError(ctx, "DisplayCommandBuffer.appendPacked() text commands require options.font");
        goto fail;
    }
    if (command_count == 0U) {
        JS_PopGCRef(ctx, &font_value_ref);
        JS_PopGCRef(ctx, &text_value_ref);
        heap_caps_free(owned_text);
        esp32_mquickjs_release_byte_source(owned);
        return *this_val;
    }
    if (!reserve_commands(ctx, command_buffer, command_count) ||
        !reserve_text(ctx, command_buffer, text_bytes)) {
        goto fail;
    }
    if (needs_font && !keep_font_alive(ctx, *this_val, command_buffer, *font_value)) {
        goto fail;
    }

    while (offset < source.length) {
        const uint8_t *packet = source.data + offset;
        uint8_t op = packet[0];
        size_t command_size = 0;
        display_command_t *command;

        switch (op) {
        case DISPLAY_COMMAND_CLEAR:
            command_size = DISPLAY_COMMAND_PACKED_CLEAR_SIZE;
            break;
        case DISPLAY_COMMAND_FILL_RECT:
        case DISPLAY_COMMAND_DRAW_RECT:
        case DISPLAY_COMMAND_DRAW_LINE:
            command_size = DISPLAY_COMMAND_PACKED_RECT_SIZE;
            break;
        case DISPLAY_COMMAND_DRAW_ROUND_RECT:
        case DISPLAY_COMMAND_FILL_ROUND_RECT:
            command_size = DISPLAY_COMMAND_PACKED_ROUND_RECT_SIZE;
            break;
        case DISPLAY_COMMAND_DRAW_TEXT:
            command_size = DISPLAY_COMMAND_PACKED_TEXT_SIZE;
            break;
        default:
            break;
        }
        if (packed_skip_command(packet, op)) {
            offset += command_size;
            continue;
        }
        command = append_command(ctx, command_buffer);
        if (command == NULL) {
            goto fail;
        }
        command->op = op;
        switch (op) {
        case DISPLAY_COMMAND_CLEAR:
            command->color = packed_u32(packet + 1U);
            break;
        case DISPLAY_COMMAND_FILL_RECT:
        case DISPLAY_COMMAND_DRAW_RECT:
            command->x = packed_i16(packet + 1U);
            command->y = packed_i16(packet + 3U);
            command->width = packed_i16(packet + 5U);
            command->height = packed_i16(packet + 7U);
            command->color = packed_u32(packet + 9U);
            break;
        case DISPLAY_COMMAND_DRAW_LINE:
            command->x = packed_i16(packet + 1U);
            command->y = packed_i16(packet + 3U);
            command->width = packed_i16(packet + 5U);
            command->height = packed_i16(packet + 7U);
            command->color = packed_u32(packet + 9U);
            break;
        case DISPLAY_COMMAND_DRAW_ROUND_RECT:
        case DISPLAY_COMMAND_FILL_ROUND_RECT:
            command->x = packed_i16(packet + 1U);
            command->y = packed_i16(packet + 3U);
            command->width = packed_i16(packet + 5U);
            command->height = packed_i16(packet + 7U);
            command->radius = packed_i16(packet + 9U);
            command->color = packed_u32(packet + 11U);
            break;
        case DISPLAY_COMMAND_DRAW_TEXT: {
            uint16_t text_offset = packed_u16(packet + 17U);
            uint16_t text_length = packed_u16(packet + 19U);
            int16_t spacing = packed_i16(packet + 15U);

            command->x = packed_i16(packet + 1U);
            command->y = packed_i16(packet + 3U);
            command->color = packed_u32(packet + 5U);
            command->background = packed_u32(packet + 9U);
            command->flags = (uint8_t)packed_u16(packet + 13U);
            if (spacing < 0) {
                spacing = 0;
            } else if (spacing > 32) {
                spacing = 32;
            }
            command->spacing = spacing;
            command->font = font;
            command->text_offset = command_buffer->text_length;
            command->text_length = text_length;
            memcpy(command_buffer->text + command_buffer->text_length,
                   packed_text + text_offset,
                   text_length);
            command_buffer->text[command_buffer->text_length + text_length] = '\0';
            command_buffer->text_length += (size_t)text_length + 1U;
            break;
        }
        default:
            break;
        }
        offset += command_size;
    }

    JS_PopGCRef(ctx, &font_value_ref);
    JS_PopGCRef(ctx, &text_value_ref);
    heap_caps_free(owned_text);
    esp32_mquickjs_release_byte_source(owned);
    return *this_val;

