99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/bitmap/esp32_mquickjs_display_command_buffer.c
fail:
    JS_PopGCRef(ctx, &font_value_ref);
    JS_PopGCRef(ctx, &text_value_ref);
    heap_caps_free(owned_text);
    esp32_mquickjs_release_byte_source(owned);
    return JS_EXCEPTION;
}

JSValue js_display_command_buffer_replay(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    display_command_buffer_t *command_buffer;
    esp32_mquickjs_bitmap_t *buffer;
    size_t i;

    command_buffer = display_command_buffer_from_value(ctx, *this_val, "DisplayCommandBuffer.replay()");
    if (command_buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc < 1) {
        return JS_ThrowTypeError(ctx, "DisplayCommandBuffer.replay(target) expects a Bitmap target");
    }
    buffer = bitmap_from_value(ctx, argv[0], "DisplayCommandBuffer.replay(target)");
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (buffer->format != command_buffer->format) {
        return JS_ThrowTypeError(ctx, "DisplayCommandBuffer.replay(target) requires a target with the same pixel format");
    }
    if (command_buffer->commands_block != NULL &&
        esp32_mquickjs_memory_block_borrow(command_buffer->commands_block) == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    if (command_buffer->text_block != NULL &&
        esp32_mquickjs_memory_block_borrow(command_buffer->text_block) == NULL) {
        esp32_mquickjs_memory_block_release(command_buffer->commands_block);
        return JS_ThrowOutOfMemory(ctx);
    }
    for (i = 0; i < command_buffer->count; ++i) {
        display_command_t *command = &command_buffer->commands[i];

        switch (command->op) {
        case DISPLAY_COMMAND_CLEAR:
            fill_rect_raw(buffer, 0, 0, buffer->width, buffer->height, command->color, true);
            break;
        case DISPLAY_COMMAND_FILL_RECT:
            fill_rect_raw(buffer, command->x, command->y, command->width, command->height, command->color, true);
            break;
        case DISPLAY_COMMAND_DRAW_RECT:
            draw_rect_raw(buffer, command->x, command->y, command->width, command->height, command->color);
            break;
        case DISPLAY_COMMAND_DRAW_LINE: {
            int min_x = command->x < command->width ? command->x : command->width;
            int min_y = command->y < command->height ? command->y : command->height;
            int max_x = command->x > command->width ? command->x : command->width;
            int max_y = command->y > command->height ? command->y : command->height;

            draw_line_raw(buffer, command->x, command->y, command->width, command->height, command->color);
            mark_dirty(buffer, min_x, min_y, max_x - min_x + 1, max_y - min_y + 1);
            break;
        }
        case DISPLAY_COMMAND_DRAW_ROUND_RECT:
            draw_round_rect_raw(buffer,
                                command->x,
                                command->y,
                                command->width,
                                command->height,
                                abs_i32_to_u32_local(command->radius),
                                command->color);
            break;
        case DISPLAY_COMMAND_FILL_ROUND_RECT:
            fill_round_rect_raw(buffer,
                                command->x,
                                command->y,
                                command->width,
                                command->height,
                                abs_i32_to_u32_local(command->radius),
                                command->color);
            break;
        case DISPLAY_COMMAND_DRAW_TEXT:
            if (esp32_mquickjs_memory_block_borrow(
                    ((esp32_mquickjs_display_font_t *)command->font)
                        ->glyphs_block) == NULL) {
                esp32_mquickjs_memory_block_release(command_buffer->text_block);
                esp32_mquickjs_memory_block_release(command_buffer->commands_block);
                return JS_ThrowOutOfMemory(ctx);
            }
            bitmap_draw_text_raw(buffer,
                                         command->x,
                                         command->y,
                                         command_buffer->text + command->text_offset,
                                         command->font,
                                         command->spacing,
                                         command->color,
                                         (command->flags & DISPLAY_COMMAND_TEXT_HAS_BACKGROUND) != 0,
                                         command->background);
            esp32_mquickjs_memory_block_release(
                ((esp32_mquickjs_display_font_t *)command->font)->glyphs_block);
            break;
        default:
            break;
        }
    }
    esp32_mquickjs_memory_block_release(command_buffer->text_block);
    esp32_mquickjs_memory_block_release(command_buffer->commands_block);
    return *this_val;
}

JSValue js_display_command_buffer_stats(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    display_command_buffer_t *command_buffer;
    JSGCRef object_ref;
    JSValue *object;

    (void)argc;
    (void)argv;

    command_buffer = display_command_buffer_from_value(ctx, *this_val, "DisplayCommandBuffer.stats()");
    if (command_buffer == NULL) {
        return JS_EXCEPTION;
    }
    object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    if (!esp32_mquickjs_set_property_ref(ctx, object, "count", JS_NewUint32(ctx, (uint32_t)command_buffer->count)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "capacity", JS_NewUint32(ctx, (uint32_t)command_buffer->capacity)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "textBytes", JS_NewUint32(ctx, (uint32_t)command_buffer->text_length)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "textCapacity", JS_NewUint32(ctx, (uint32_t)command_buffer->text_capacity))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

#endif
